[
    {
        "id": "userIntroduction",
        "icon": "AssignmentIcon",
        "title": "User Manual > Introduction",
        "content": "Introduction This User Manual (UM) provides the information necessary for students and examiners to effectively use the Sentinel web application which uses Artificial Intelligence (AI) software to prevent misconduct during exams. This application aims to enable examiners to detect misconduct easily and allow students to perform their respective exams while being monitored in the easiest way possible. The scope of this application was to deliver a web-based application to schools that could revitalise the way schools hold their online exams. Given this scope, the main requirements that the business analyst was able to derive from the perspective of both the students and the examiners includes the following: To be able to verify the student’s identity upon login. To flag any incidents of misconduct during an exam. To be able to terminate a student’s exam when there are two flagged incidents. To keep a log of incidents for each exam. To keep full-length videos of students where misconduct was not detected. In the event of a system or software update (including bug fixes and the creation of additional features), newer versions of this user manual will be released to keep up with these changes. Because the student’s camera feed and all user information (including that of the examiner) is being stored, it is essential to have privacy protection software. All video information stored on the database will be encrypted and will require user authentication. Passwords stored on the system will be salted and password complexity will also be enforced. Data privacy and protection is at the core of the Sentinel AI Cheating Detection Software."
    },

    {
        "id": "userOverview",
        "icon": "AssignmentIcon",
        "title": "User Manual > Overview",
        "content": "Overview The Sentinel Web-Based Application is an AI Anti-Cheating Detection Software that was created to facilitate online exams and detect cheating incidents with ease. Our system integrates features that are separately accessible to both the students and the examiners. For the examiner side, this system will allow them to easily detect misconduct incidents and allow them to easily terminate an exam. They are also able to go back and review cheating incidents which will be stored on the database. This will reduce the need for constant monitoring on the examiners end and will ensure that students also have a fair assessment of their learning. Since the beginning of COVID-19, most if not all educational institutions have turned to online modes of learning. With the shift to online learning, students can more easily access information at their disposal than ever before. However, this means that they also have an opportunity to misuse data including using the internet and other resources to cheat during exams (Newton, 2023). Our aim in developing this product was to reduce cheating incidents and to ensure fairness and equality when taking online exams. In order to reduce wrongful termination during a student’s exam, the examiner has the ability to accept or decline the termination if two warnings are given. An extra exam log post exam will show the flagged incidents and allow the examiner to access the clip of the cheating incident. To use the system, the users will be authenticated based on the student/staff email address and password provided by the university. Conventions Figure 1 Introduction to Sentinel Figure 1 provides a high-level view of the student flagging process and how each component of our anti cheating system interacts with one another. Data is stored in the MongoDB Database which is hosted separately from the Sentinel System. The user uses the browser through the React Front-end design to interact with different pages of the system. The main functions of our system include but are not limited to: Login - There are two different logins for the student and examiner user. Each login will bring the user to different home screens with different access rights. Student Functionality View past examinations View scheduled proctored examinations Start a proctored examination session Test their equipment before the exam Examiner Functionality View a suspicious incident clip View recordings of all students who have completed the exam View the flagging log after the exam View exam schedule Schedule an Exam Start an Exam (and view the live feed from the exam) Manage classes Cautions & Warnings Security: The Sentinel system uses authentication measures, parses middleware and also has data secured in a secured database to ensure that all sensitive information is kept secure. Although password complexity is not enforced during login, users are encouraged to utilise complex passwords for additional account security. All login methods lead to different types of homepages depending on which user is currently signed in. Each account is secured with an email and a password that has been provided by the university and is unique to each user in our system. Utilising MongoDB to store user information ensures an increased information security because of the data encryption in the MongoDB software. Only authorised users can access the data stored in MongoDB. When paired with the password encryption and salting, the system provides a high level of system security. Tokenisation: The Sentinel application utilises tokenisation techniques to increase convenience and efficiency for the user utilising our application. Because tokenisation reduces the sign in attempts, the security of the account may be decreased. Users must be more vigilant about giving access to their device when signed into the Sentinel Application. Privacy Policy: Before the user begins their exam, they will be brought into an exam waiting room where they will have a Privacy Policy displayed on their screen with a tickbox. For the user to begin their exam, they must first accept the privacy policy. This ensures that the user is aware about the cautions and warnings associated with the Sentinel System."
    },

    {
        "id": "userGettingStarted",
        "icon": "AssignmentIcon",
        "title": "User Manual > Getting Started",
        "content": "Getting Started This Sentinel application is accessible through “Sentinel.com” through any browser such as Firefox, Google Chrome or Safari on any operating system of choice. Once the user has launched the website, they will be brought to the landing page to either visit the Help Centre or log into the Sentinel system. A screenshot of both the Landing page, Login pages and Home pages are placed below. After the user has entered the URL into their desired search browser, they will be brought to the homepage shown above. The user can choose the “Sign In” button to log into their account and view functions within the account. Once the user has placed their email, they will be redirected to their respective login page (student or admin login). The admin will be prompted to login with a username and password while the student login utilises facial login, reducing the risk of cheating incidence by increasing login complexity. The users will be brought to their respective homepages after successful login. Set-up Considerations The Sentinel system requires constant internet connection to continue using the system and to detect cheating instances accurately. To ensure that the internet is connected on an Apple MacBook, navigate to the wifi symbol located on the menu bar on your screen and connect to your desired internet network. This application is designed to access your camera and your microphone to detect instances of cheating. To optimise your access to Sentinel: Please enable pop-up blockers prior to attempting access to Sentinel. Enable the camera and microphone access on Chrome before accessing Sentinel by clicking on the lock button on the upper left hand corner of the navigation bar. Please use the button “Run System Test” on the Sentinel system to ensure that your device is working. User Access Considerations For the Sentinel software, there are two types of users that log into their specific homepage based on the corresponding user types: student and examiner. The two users have different home pages after login and have different functionality in each user type. Both accounts have the ability to view upcoming exams and previous exams (but are formatted differently). Examiners have the ability to schedule new exams, view suspicious clips of a student, view a flag log after an examination and terminate a student’s exams after two subsequent flags have been raised. Additionally, they are also able to view all students currently sitting the exam. The student access on the other hand is limited to exam access and does not have any of the examiner functionality except viewing exams. Accessing the Software To access the Sentinel software, there are two types of sign-in modes depending on the user type. The examiner login utilises an email and password login while the student login utilises facial recognition software to log in. If the examiner logging in does not have valid login details or if they have forgotten their login details, they must contact the institution’s information technology department to solve this issue and receive their login details. In the case of the student login, they must lodge an external form that will upload their facial data and landmarks into the system, enabling them to log in. Common issues relating to Facial Authentication for students will be in the Help Centre > Face Auth Troubleshoot. For privacy purposes, the users will not be allowed to change their login details directly on the Sentinel application. To easily contact the IT department, go to the Help Centre > Contact Us. Software Organization & Navigation For different types of users, there are different menu options or ways to navigate through the Sentinel system. When the user inputs the URL into their browser, they will be brought to the main page where they can choose to Sign In or view the Help Centre. Examiner Account Login - If the user has previously received login details from their IT department, they are able to easily log into the sentinel system by signing up with their username and password. Home - When the examiner is logged in, they can press the Home button on the menu bar above to navigate back to the homepage.Login - The examiner must be logged in to their account to perform the functions below. View Exam Schedule - Select the Schedule button from the menu bar above. Create an Exam Session - Select the Create Session Icon on the tiled menu displayed on the screen. View Exam History - Select the Exam History Icon on the tiled menu displayed on the screen. Login - The examiner must be logged into their account to perform the functions below. Launch an Exam - Select the Launch Exam Icon on the tiled menu displayed on the screen. View Flagged Activity - Select the Activity button on the menu bar above. Manage Classes - Select the Manage Classes Icon on the tiled menu displayed on the screen. Login - If the user has previously signed up for a Sentinel account through an external form lodged with the IT Department, they should be able to sign in simply by using their facial data. Home - When the Student is logged in, they can press the Home button on the menu bar above to navigate back to the Student Homepage. Login - The student must be logged into their account to perform the functions below. View Previous Exams  - Select the “View Previous Exams” button on the upper-right corner of the Upcoming Exams table. Access Exam - Select the Access Exam button of the exam that you want to access. Login - The student must be logged into their account to perform the functions below. Test Your Equipment - Select the Test Your Equipment at the bottom of the page to ensure that your camera and microphone are working as intended. Exiting the Software To exit the Sentinel web application, the user must click on their profile on the upper-right hand corner of the menu bar followed by “Sign Out”. Once the user has successfully signed out, they will be redirected back to the main Sentinel page. The user can choose to exit the page upon being redirected to the main page."
    },

    {
        "id": "userSoftware",
        "icon": "AssignmentIcon",
        "title":"User Manual > Using the Software",
        "content": ""
    },

    {
        "id": "userTroubleshooting",
        "icon": "AssignmentIcon",
        "title": "User Manual > Troubleshooting and Support",
        "content": "Troubleshooting And Support There are several error messages and remediation actions embedded into Sentinel to enable a smooth and easy user experience across the site. These messages have been detailed with the process, description, and where necessary, the remediation strategy. Sentinel is currently in beta testing and open to bug fix and error handling suggestions. Error Messages ERROR MESSAGE LOCATION CONTEXT REMEDIATION Login failed: Invalid credentials Admin and Student Login Forms There is a mismatch between username/email and password (or facial data). The username does exist. Enter the correct password and ensure facial data is being used against the correct username/email. If the password has been forgotten, contact the university. Login failed: User does not exist Admin and Student Login Forms The username/email does not exist in the database, and therefore, has not been registered to Sentinel by the university. Contact the university to register the correct email address to the user. Login failed: Internal Server Error Admin and Student Login Forms The backend server has failed or the post request did not go through in time. Raise a ticket with Sentinel and the developers will investigate whether the server requires a restart or permission change. Special Considerations Certain special considerations have been made, particularly as the system is in early stages of development and user acceptance testing is in progress. On rare occasions, a user will be presented with a “No Access” screen despite logging in successfully under an account with correct privileges. This is due to the request processing quickly that the token cannot be read before the component is loaded. A simple page refresh will remediate this. Support Although Sentinel has made due diligence in troubleshooting major bugs, dynamic systems and unique user interactions may still enable errors to arise. Since the system is enabled by tertiary education institutions, support relating to password resets, examination queries, and flagging negotiations are directed to the relevant institution through the contact page linked in the ribbon. For the table below, the University of Technology Sydney (UTS) was taken as an example due to the initial beta rollout being for the university specifically. However, system related errors such as slow processing times, access requirements, and incorrect data can be directed to Sentinel through our incident management system. CONTACT PHONE EMAIL ROLE RESPONSIBILITY Tertiary Education Institute (UTS) Account and Exam Manager, Academic Integrity Support Sentinel Incident Management System Manager, Technical Support"
    },

    {
        "id": "flags",
        "icon": "AssignmentIcon",
        "title": "Flagging",
        "content": "The Sentinel application utilises a Machine Learning Model to detect certain patterns and behaviours as 'cheating'. This involves running a script that analyses frames from the real-time video provided by the webcam each interval; for this system, is every ~5ms. In the event a 'cheating' behavious is detected by the system, the admin overseeing the exam session is notified of the event, being provided a short recorded clip of the detecetd behaviour. Figure 1: Student misconduct requireing approval, admin perspective. If the admin verifies the flagged behaviour is a valid cheating instance, the student is notified and promptly warned of their misconduct. Figure 2: Student misconduct flag, student perspective. The Machine Learning model analyses frames from the webcam to detect cheating through two methodologies, objection recognition analysis and facial landmark analysis. Object cheating behaviours. The script interprets all objects in the camera feed, and raises a flag if any banned items are detected. These include: Mobile phone, laptop, keyboard, and mouse. This aligns with the criteria, whereby a student should only have a pen, paper, eraser and calculator at any given time. Figure 3: Example mobile phone detection frame. This model also raises a flag if more than one person is present in the frame; only the student being examinated should be present at all times.Facial Landmark Behaviours. The script identifies facial landmarks and draws a mesh over the student's face, comparing these in real-time to determine if two key events occur: If the student turns their head away from the screen. If the student looks away from the designated exam screen. These behaviours have been identified as key indicators of a student engaging in suspicious activities, as this suggest the student is viewing content through an external source. Figure 4: Example facial landmark analysis for gaze detection."
    },

    {
        "id": "termsAndConds",
        "icon": "AssignmentIcon",
        "title": "Terms and Conditions",
        "content": "These terms and conditions (the Agreement) govern the use of an AI Online Exam Proctoring Tool (the Service) provided by Sentinel (the Company) to the user (the User). By using this service, the user agrees to abide by the terms and conditions outlined below: 1. Acceptance of Terms By using this service, the User acknowledges and agrees to these Terms and Conditions. If the User does not agree to these terms, they should refrain from using the Service. 2. User Eligibility This Service is intended for use by educational institutions, examiners and students. To use the service, users must be at least 18 years of age or have the consent of a parent or guardian to use the Service. 3. Registration and Account Security The User is responsible for maintaining the confidentiality of their login credentials and account information. The User is also responsible for any activities conducted through their account. If the User suspects any unauthorised access to their account, they must notify their provider immediately. 4. Privacy and Data Usage The Provider may collect, use and process personal data and information provided by the User in accordance with the Privacy Policy, which can be found on the provider's website. 5. Proctoring and Monitoring The Service uses AI and other technologies to proctor and monitor online exams. This includes but is not limited to webcam, microphone and screen mirroring. The User's actions, such as eye movements and background noise, may be recorded during an examination. 6. Code of Conduct The User agrees to adhere to the following code of conduct while using the Service: a. The User will not attempt to cheat or engage in any form of academic dishonesty. b. The User will not impersonate or provide false information. c. The User will not disrupt or interfere with the operation of the Service. d. The User will not attempt to reverse engineer, hack, or modify the Service. e. The User will not share or distribute exam content without permission. 7. Exam Results and Reporting The Provider will share the results of proctored examinations and corresponding flag logs with authorised individuals or organizations, such as instructors, educational institutions, or third-party exam providers, as specified by the User or required by law. 8. Termination The Provider reserves the right to suspend or terminate a User's access to the Service at any time, for any reason, without notice. In case of termination, the User will not be entitled to a refund of any fees paid. 9. Contact Information For any questions or concerns regarding these Terms and Conditions or the Service, the User may contact the Provider at service@Sentinel.com. By using the AI Online Exam Proctoring Tool, the User acknowledges and accepts these Terms and Conditions."
    }
]
